_Rarzrabotki/Rarus/USO2/Reports/уатСравнениеПробегаИРасходаПоПутевымЛистамИПоДаннымМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>уатСравнениеПробегаИРасходаПоПутевымЛистамИПоДаннымМониторинга</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатПробегРасходПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатПробегРасходПоМониторингу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРаботыДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОдометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/уатСравнениеПробегаИРасходаПоПутевымЛистамИПоДаннымМониторинга/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПробегGPS(ТС, ДатаВыезда, ДатаВозвращения) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",              ТС);
	Запрос.УстановитьПараметр("ДатаВыезда",      ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаВозвращения", ДатаВозвращения);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(уатПробегРасходПоМониторингу.Пробег), 0) КАК Пробег
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.ТС = &ТС
	|	И уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаВыезда И &ДатаВозвращения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Пробег;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМоточасыGPS(ТС, ДатаВыезда, ДатаВозвращения) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",              ТС);
	Запрос.УстановитьПараметр("ДатаВыезда",      ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаВозвращения", ДатаВозвращения);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(уатПробегРасходПоМониторингу.ВремяРаботыДвигателя), 0) КАК ВремяРаботыДвигателя
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.ТС = &ТС
	|	И уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаВыезда И &ДатаВозвращения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ВремяРаботыДвигателя;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРасходGPS(ТС, ДатаВыезда, ДатаВозвращения) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",              ТС);
	Запрос.УстановитьПараметр("ДатаВыезда",      ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаВозвращения", ДатаВозвращения);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(уатПробегРасходПоМониторингу.РасходТоплива), 0) КАК РасходТоплива
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.ТС = &ТС
	|	И уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаВыезда И &ДатаВозвращения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.РасходТоплива;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Сравнение пробега и расхода по путевым листам и по данным мониторинга");
	НастройкиВарианта.Описание = НСтр("en='Report provides comparative information on fuels consumption and vehicle mileage according to routing lists and monitoring system.';ru='Отчет позволяет получить сравнительную информацию о расходе ГСМ и пробеге ТС по данным путевых листов и системы мониторинга.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
